Documents/РегистрацияВходящегоНалоговогоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РегистрацияВходящегоНалоговогоДокумента</Name>
			<BasedOn>
				<xr:Item>Document.ОтчетКомитенту</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.РасходнаяНакладная</xr:Item>
				<xr:Item>Document.ОтчетОПереработке</xr:Item>
				<xr:Item>Document.ПоступлениеВКассу</xr:Item>
				<xr:Item>Document.ПоступлениеНаСчет</xr:Item>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозвратнойТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаВА</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректируемогоВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректируемогоВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаетсяВУточняющийРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецРежимНалогообложения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточняемыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеКорректировки</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетПроверкиВключенияВЕдиныйРеестрНалоговыхНакладных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВключенияВЕдиныйРеестрНалоговыхНакладных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиВекселя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогашенияВекселя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаПогашенияВекселя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеТовара</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяКнигиПриобретения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Амортизируется</Name>
							<Comment>Поставка Основных фондов. Исользуется для запонения Приложения 5 к Декларации по НДС (с 2008 г)</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляОперацийОблагаемыхНДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляХозяйственнойДеятельности</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРегистрацияВходящегоНалоговогоДокумента</Name>
			<Comment>Виды операций документа регистрация входящего налогового документа</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговаяНакладная</Name>
					<Comment>Налоговая накладная входящая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварныйЧек</Name>
					<Comment>Товарный чек или другой расчетный документ от резидента </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетКорректировкиВозврат</Name>
					<Comment>Расчет корректировки стоимости (входящий)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетКорректировкиКорректировка</Name>
					<Comment>Расчет корректировки стоимости (входящий)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортПрочее</Name>
					<Comment>Импорт не товаров с оплатой НДС по ГТД</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортВексель</Name>
					<Comment>Импорт товаров, на которые оформлен налоговый вексель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BeксeльПpoшлoгoПepиoдa</Name>
					<Comment>Налоговый вексель, погашеный в прошлом периоде</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеНалоговогоВекселя</Name>
					<Comment>Погашение налогового векселя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботыОтНерезидента</Name>
					<Comment>Работы, полученные от нерезидента (не используется после 29/07/2005)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботыОтНерезидентаПрошлогоПериода</Name>
					<Comment>Работы, полученнные от нерезидента в прошлом периоде</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенноеОформлениеТоваровКомитента</Name>
					<Comment>Регистрация ГТД оформленной при импорте комиссионных товаров. Право на кредит возникает при перечислении денег комитенту за реализованный товар</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РегистрацияВходящегоНалоговогоДокумента/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура заполняет вид операции 
// Параметры: 
//  ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьВидОперации(ДанныеЗаполнения)
	
	мВалютаРегламентированногоУчета = Константы.НациональнаяВалюта.Получить();
	
	Если  ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") 
	  ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеВКассу")
	  ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
		// возврат
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходИзКассы")
		  ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходСоСчета") Тогда
		  
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") тогда 
		 Если НЕ (ДанныеЗаполнения.ВалютаДокумента = мВалютаРегламентированногоУчета) Тогда	
		
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода;
		Иначе
			
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомиссионера")  
		 И НЕ (ДанныеЗаполнения.ВалютаДокумента = мВалютаРегламентированногоУчета) Тогда	
		
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода;
			
	Иначе
		
		Если НЕ (ДанныеЗаполнения.Ссылка.Метаданные().Реквизиты.Найти("УчитыватьНДС") = Неопределено) 
			И    ДанныеЗаполнения.УчитыватьНДС Тогда
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
		ИначеЕсли НЕ (ДанныеЗаполнения.Ссылка.Метаданные().ТабличныеЧасти.Найти("РасшифровкаПлатежа") = Неопределено) тогда 
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
		Иначе
			//покупка у неплательщика НДС. Основание включения в книгу - товарний чек (п. 10.2 Порядка)
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьВидОперации()

// Функция определеяет рекомендуемое значение статьи налоговой декларации (СтатьяКнигиПриобретения)
// в зависимости от вида операции документа и значений параметров учета, указанных в строке ТЧ
//
// Параметры:
// СтрокаТЧ - строка ТЧ Товары (возвратная тара в книгу покупок не попадает)
//
Функция ОпределитьСтатьюНалоговойДекларации(СтрокаТЧ) Экспорт
	
	СтатьиДеклараций = Справочники.СтатьиНалоговыхДеклараций;

	Если  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ПогашениеНалоговогоВекселя Тогда			
		
		Если Дата >= '20110301' Тогда
			Возврат  СтатьиДеклараций.ПустаяСсылка();
		Иначе	
			Возврат  СтатьиДеклараций.НДС_БюджКорректировкаВексельПогашенный;
		КонецЕсли;
		
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидента Тогда		
		
		// 7 Декларации,
		// 9 Книги приобретений
		Возврат  СтатьиДеклараций.НДС_НОНерезидентУслуги
		
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИмпортПрочее Тогда		
		// импорт не товаров
		Если 	СтрокаТЧ.СтавкаНДС.Ставка = 0 
			ИЛИ СтрокаТЧ.СтавкаНДС =  Справочники.СтавкиНДС.ОсновнаяСтавкаНДС ИЛИ СтрокаТЧ.СтавкаНДС.Ставка = 7 Тогда
			// ст 12.1 Декларации
			Возврат СтатьиДеклараций.НДС_НКИмпортВРОблагНДСТамож;
		Иначе
			// ст 12.3 Декларации
			Возврат СтатьиДеклараций.НДС_НКИмпортВРОблагБезНДС;
		КонецЕсли;
		
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИмпортВексель Тогда
		// импорт по векселю
		Если 	СтрокаТЧ.СтавкаНДС.Ставка = 0 
			ИЛИ СтрокаТЧ.СтавкаНДС =  Справочники.СтавкиНДС.ОсновнаяСтавкаНДС ИЛИ СтрокаТЧ.СтавкаНДС.Ставка = 7 Тогда
			// ст 6 Декларации
			Возврат СтатьиДеклараций.НДС_НОИмпортВексель;
		КонецЕсли; 

	Иначе
		// НалоговаяНакладная 
		// ТоварныйЧек 
		// РасчетКорректировки
		// РаботыОтНерезидентаПрошлогоПериода 
		// BeксeльПpoшлoгoПepиoдa 
		
		// Считаем, что есть право на налоговый кредит	
			
		Если    СтрокаТЧ.СтавкаНДС.Ставка = 0 
			ИЛИ СтрокаТЧ.СтавкаНДС =  Справочники.СтавкиНДС.ОсновнаяСтавкаНДС ИЛИ СтрокаТЧ.СтавкаНДС.Ставка = 7 Тогда
			// приобретение с уплатой НДС
			
			Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная
				ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки
				ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек Тогда
				
				// 10.1 Декларации,

					Если (Дата >= '20080101' И Дата < '20110301') И Договор.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом Тогда	
						
						Возврат  СтатьиДеклараций.НДС_НКПокупкаСНДСвВРОблагКомиссия;
						
					Иначе
						
							Возврат  СтатьиДеклараций.НДС_НКПокупкаСНДСвВРОблаг;
						
					КонецЕсли;
				
			ИначеЕсли   ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
				ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка	Тогда
								
				Возврат СтатьиДеклараций.НДС_НКИзменениеСтоимости	
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода Тогда
								
				Возврат  СтатьиДеклараций.НДС_НКИмпортВРОблагУслугиНерезидента;
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.BeксeльПpoшлoгoПepиoдa Тогда
								
				Возврат  СтатьиДеклараций.НДС_НКИмпортВРОблагВексель;
				
			ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТаможенноеОформлениеТоваровКомитента Тогда
				
				
					Возврат  СтатьиДеклараций.НДС_НКИмпортВРОблагНДСТамож;
					
				
			КонецЕсли;
			
		Иначе
			
			// приобретение без НДС
			Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная
				ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки
				ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек Тогда
				
					// 11.1 Декларации,
					Возврат  СтатьиДеклараций.НДС_НКПокупкаБезНДСвВРОблаг;
					
				ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
					  ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка	Тогда
					  
					Если Дата < '20110301' Тогда
						 Возврат  СтатьиДеклараций.НДС_НКПокупкаБезНДСвВРОблаг;
					Иначе	
						 Возврат  СтатьиДеклараций.НДС_НККорректировкаБезНК;
					КонецЕсли; 
				
			Иначе
				// Импорт
				
				Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода Тогда
					
					// странно, услуги от нерезидента успользуемые на территории Украины облагаются по ставке 20%
					Возврат  СтатьиДеклараций.ПустаяСсылка();
					
				ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.BeксeльПpoшлoгoПepиoдa Тогда
					
					// странно, был оформлен  вексель по ГТД не предусматривающей уплаты НДС
					Возврат  СтатьиДеклараций.ПустаяСсылка();
					
				ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТаможенноеОформлениеТоваровКомитента Тогда
					
					
					Возврат  СтатьиДеклараций.НДС_НКИмпортВРОблагБезНДС;
						
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;	
	
	КонецЕсли;			
	
КонецФункции // ОпределитьСтатьюНалоговойДекларации()

// Процедура заполнения документа на основании отчета комитенту
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ОтчетКомиссионера - отчет комитенту
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоОтчетКомитенту(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
	Договор = ДанныеЗаполнения.Договор;
			
	Комментарий = ДанныеЗаполнения.Комментарий;
	              	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.Запасы Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		СтрокаЗапасов.НаименованиеТовара 	= ТекСтрока.Номенклатура.Наименование;
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Сумма 				= ТекСтрока.Всего - ТекСтрока.СуммаНДС;
		СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Всего;		
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.СуммаВзаиморасчетов;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоОтчетКомитенту()

// Процедура заполнения документа на основании приходной накладной
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ПриходнаяНакладная - приходная накладная
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоПриходнаяНакладная(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
	Договор = ДанныеЗаполнения.Договор;
			
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	ЗапасыПоДокументуОснованию = ДокументОснование.Запасы.Выгрузить();
	РасходыПоДокументуОснованию = ДокументОснование.Расходы.Выгрузить();
	
	ЗапасыПоДокументуОснованию.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
	РасходыПоДокументуОснованию.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
	
	Для Каждого ТекСтрока Из ЗапасыПоДокументуОснованию Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		Если ДокументОснование.СуммаВключаетНДС Тогда
			СтрокаЗапасов.Сумма 				= ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
			СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Сумма;
			СтрокаЗапасов.Всего                 = СтрокаЗапасов.СуммаВзаиморасчетов;
		Иначе	
			СтрокаЗапасов.Сумма 				= ТекСтрока.Сумма;
			СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Сумма + ТекСтрока.СуммаНДС;
			СтрокаЗапасов.Всего                 = СтрокаЗапасов.СуммаВзаиморасчетов;
		КонецЕсли; 
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		
	КонецЦикла;
	
	Для Каждого ТекСтрока Из РасходыПоДокументуОснованию Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		Если ДокументОснование.СуммаВключаетНДС Тогда
			СтрокаЗапасов.Сумма 				= ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
			СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Сумма;
			СтрокаЗапасов.Всего                 = СтрокаЗапасов.СуммаВзаиморасчетов;
		Иначе
			СтрокаЗапасов.Сумма 				= ТекСтрока.Сумма;
			СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Сумма + ТекСтрока.СуммаНДС;
			СтрокаЗапасов.Всего                 = СтрокаЗапасов.СуммаВзаиморасчетов;
		КонецЕсли; 
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоПриходнаяНакладная()

// Процедура заполнения документа на основании отчета комиссионера
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ОтчетКомиссионера - отчет комиссионера
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоОтчетКомиссионера(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
	Договор = ДанныеЗаполнения.Договор;
			
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.Запасы Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		СтрокаЗапасов.НаименованиеТовара 	= ТекСтрока.Номенклатура.Наименование;
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Сумма 				= ТекСтрока.Сумма;
		СтрокаЗапасов.Цена 					= ТекСтрока.Цена;
		СтрокаЗапасов.Количество 			= ТекСтрока.Количество;
		СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Сумма + ТекСтрока.СуммаНДС;		
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.СуммаВзаиморасчетов;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоОтчетКомиссионера()

// Процедура заполнения документа на основании счета на оплату
//
// Параметры:
//	ДокументОснование - ДокументСсылка.СчетНаОплату - счет на оплату
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоСчетНаОплату(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
	Договор = ДанныеЗаполнения.Договор;
			
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.Запасы Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		СтрокаЗапасов.НаименованиеТовара 	= ТекСтрока.Номенклатура.Наименование;
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Цена 					= ТекСтрока.Цена;
		СтрокаЗапасов.Количество 			= ТекСтрока.Количество;
		СтрокаЗапасов.Сумма 				= ТекСтрока.Всего - ТекСтрока.СуммаНДС;
		СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Всего;		
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.СуммаВзаиморасчетов;
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьПоСчетНаОплату()

// Процедура заполнения документа на основании расходной накладной
//
// Параметры:
//	ДокументОснование - ДокументСсылка.РасходнаяНакладная - расходная накладная
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоРасходнаяНакладная(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
		
		ТекстИсключения = НСтр("ru='На основании документа ""Расходная накладная"" можно вводить ""Регистрация входящего налогового документа"" только при возврате поставщику!';uk='На підставі документа ""Видаткова накладна"" можна вводити ""Реєстрація вхідного податкового документа"" тільки при поверненні постачальникові!'");				
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;	
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
	Договор = ДанныеЗаполнения.Договор;
			
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.Запасы Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		СтрокаЗапасов.НаименованиеТовара 	= ТекСтрока.Номенклатура.Наименование;
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Цена 					= ТекСтрока.Цена;
		СтрокаЗапасов.Количество 			= ТекСтрока.Количество;
		СтрокаЗапасов.Сумма 				= ТекСтрока.Всего - ТекСтрока.СуммаНДС;
		СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Всего;		
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.СуммаВзаиморасчетов;
		
	КонецЦикла;
	       	
КонецПроцедуры // ЗаполнитьПоРасходнаяНакладная()

// Процедура заполнения документа на основании отчета о переработке
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ОтчетОПереработке - отчет о переработке
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоОтчетОПереработке(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
	Договор = ДанныеЗаполнения.Договор;
			
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.Продукция Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		СтрокаЗапасов.НаименованиеТовара 	= ТекСтрока.Номенклатура.Наименование;
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Сумма 				= ТекСтрока.Сумма;
		СтрокаЗапасов.Цена 					= ТекСтрока.Цена;
		СтрокаЗапасов.Количество 			= ТекСтрока.Количество;
		СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Сумма + ТекСтрока.СуммаНДС;		
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.СуммаВзаиморасчетов;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоОтчетОПереработке()

// Процедура заполнения документа на основании поступления в кассу
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ПоступлениеВКассу - поступление в кассу
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоПоступлениеВКассу(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
				
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.РасшифровкаПлатежа Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		Договор = ТекСтрока.Договор;		
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Сумма 				= ТекСтрока.СуммаПлатежа;				
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоПоступлениеВКассу()

// Процедура заполнения документа на основании поступления на счет
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ПоступлениеНаСчет - поступление на счет
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоПоступлениеНаСчет(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
				
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.РасшифровкаПлатежа Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		Договор = ТекСтрока.Договор;		
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Сумма 				= ТекСтрока.СуммаПлатежа;				
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.Сумма;
		
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьПоПоступлениеНаСчет()

// Процедура заполнения документа на основании авансового отчета
//
// Параметры:
//	ДокументОснование - ДокументСсылка.АвансовыйОтчет - авансовый отчет
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоАвансовыйОтчет(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	 
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
				
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.Запасы Цикл
		
		СтрокаЗапасов = Запасы.Добавить();		
		СтрокаЗапасов.НаименованиеТовара 	= ТекСтрока.Номенклатура.Наименование;
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Сумма 				= ТекСтрока.Всего - ТекСтрока.СуммаНДС;
		СтрокаЗапасов.СуммаВзаиморасчетов	= ТекСтрока.Всего;		
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.СуммаВзаиморасчетов;
		
	КонецЦикла;		
	
КонецПроцедуры // ЗаполнитьПоАвансовыйОтчет()

// Процедура заполнения документа на основании расхода из кассы
//
// Параметры:
//	ДокументОснование - ДокументСсылка.РасходИзКассы - расход из кассы
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоРасходИзКассы(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
				
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.РасшифровкаПлатежа Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		Договор = ТекСтрока.Договор;		
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Сумма 				= ТекСтрока.СуммаПлатежа;				
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоРасходИзКассы()

// Процедура заполнения документа на основании расхода со счета
//
// Параметры:
//	ДокументОснование - ДокументСсылка.РасходСоСчета - расход со счета
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоРасходСоСчета(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Контрагент = ДанныеЗаполнения.Контрагент;	
	Организация = ДанныеЗаполнения.Организация;	
	
	ДоговорСделка 	   = "";
				
	Комментарий = ДанныеЗаполнения.Комментарий;
	                         	
	Запасы.Очистить();
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.РасшифровкаПлатежа Цикл
		
		СтрокаЗапасов = Запасы.Добавить();
		Договор = ТекСтрока.Договор;		
		СтрокаЗапасов.СтавкаНДС 			= ТекСтрока.СтавкаНДС;
		СтрокаЗапасов.СуммаНДС 				= ТекСтрока.СуммаНДС;
		СтрокаЗапасов.Сумма 				= ТекСтрока.СуммаПлатежа;				
		СтрокаЗапасов.СтатьяКнигиПриобретения	= ОпределитьСтатьюНалоговойДекларации(СтрокаЗапасов);
		СтрокаЗапасов.Всего = СтрокаЗапасов.Сумма;
		
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьПоРасходСоСчета()

////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	  	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения)) ИЛИ ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВидОперации(ДанныеЗаполнения);
	
	мВалютаРегламентированногоУчета = Константы.НациональнаяВалюта.Получить();
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		ЗаполнитьПоОтчетКомитенту(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
		 Если ДанныеЗаполнения.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда			
			ЗаполнитьПоПриходнаяНакладная(ДанныеЗаполнения);
		КонецЕсли;			
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		ЗаполнитьПоОтчетКомиссионера(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") 
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда		
		ЗаполнитьПоСчетНаОплату(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ЗаполнитьПоРасходнаяНакладная(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетОПереработке") Тогда
		ЗаполнитьПоОтчетОПереработке(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
		ЗаполнитьПоПоступлениеВКассу(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
		ЗаполнитьПоПоступлениеНаСчет(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходИзКассы") Тогда
		ЗаполнитьПоРасходИзКассы(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходСоСчета") Тогда
		ЗаполнитьПоРасходСоСчета(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		ЗаполнитьПоАвансовыйОтчет(ДанныеЗаполнения);		
	КонецЕсли;
			
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Запасы.Итог("Всего");
	
КонецПроцедуры // ПередЗаписью()
